userInput = input('Enter a phrase\n''>>>') # строка пользователя
# a = userInput.find('(')  # присвоение переменной индекс первой '('
# b = userInput.find(')')  # присвоение переменной индекс первой ')'
#
# # проверка на наличие символа '(' и ')'
# if '(' and ')' in userInput:
#     print(userInput[:a] + userInput[b + 1:])
#     # вывести строку от начала до индекса '(' не включительно и от ')'не включительно до конца
# else:
#     print(userInput)  # если есть одна или нету вовсе, вывести первоначальную строку


