# secondLesson
# Homework task #2
# Старт сценарію
print('Обрахунок комунальних послуг\n'
      'Під час обрахунку використовуються перші 5 цифр на газовому лічильнику\n'
      'Але БЕЗ нулів на початку')

# Вхідні дані користувача(показники лічильника)
inputPast = int(input('Введіть минулі показники: '))
inputPresent = int(input('Введіть теперішні показники: '))

# Обробка помилки
if inputPast > inputPresent:
    print('Сталася помилка :( \n'
          'Минулі показники не можуть бути меншими,ніж теперішні')
    exit()

# Вхідні дані користувача(вибір тарифа)
inputTariff = int(input("""Виберіть тариф(числом)
1-Волинська область( 7.98 грн/м.куб)
2-Дніпропетровська область( 8.46 грн/м.куб)
3-Київська область (9.95 грн/м.куб)
>> """))

# Інструкція if else для визначення тарифу по вхідним даним користувача
if inputTariff == 1:
    x = (inputPresent - inputPast) * 7.98
    print(f'Сума до сплати:{round(x, 2)} гривень')
elif inputTariff == 2:
    x = (inputPresent - inputPast) * 8.46
    print(f'Сума до сплати:{round(x, 2)} гривень')
elif inputTariff == 3:
    x = (inputPresent - inputPast) * 9.95
    print(f'Сума до сплати:{round(x, 2)} гривень')
else :
    exit()