# початок програми
while True:
    s = input('=>').lower().replace(' ', '').replace('?', '')  # фраза користувача + форматування рядка(нижній регістр,
    # пробіли,знак питання)
    if 'привіт' in s or 'хай' in s or 'доброгодня' in s:  # перевірка на наявність схожих слів
        print('=>Доброго вечора, я бот з України')
    elif 'яксправи' in s or 'щоробиш' in s or 'чимзаймаєшся' in s:
        print('=>Вчусь програмувати на Python!')
    elif 'фільм' in s or 'кінотеатр' in s or 'серіал' in s:
        print('=>Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал/фільм *ваша відповідь*, '
              'він просто бомба!')
    elif 'бувай' in s or 'надобраніч' in s or 'гудбай' in s or 'дозустрічі' in s:
        print('=>Побачимось у мережі, I\'ll be back.')
        break  # закінчення програми, якщо будуть схожі слова
    else:
        print('Дуже цікаво, але, нажаль, нічого не зрозуміло :(')  # якщо не буде збігу, то програма запросить
        # введення знову

# У мене запитання з приводу закоментованого коду,а саме чому "if 'привіт' or 'хай' or 'доброго дня' in s" не працює
# а "'привіт' in s or 'хай' in s or 'доброгодня' in s" працює. Не зміг знайти відповіді(
# while True:
#     s = input('=>')
#     if 'привіт' or 'хай' or 'доброго дня' in s.lower():
#         print('=>Доброго вечора, я бот з України')
#     elif 'яксправи' or 'щоробиш' or 'чимзаймаєшся' in s.lower().replace(' ', '').replace('?', ''):
#         print('=>Вчусь програмувати на Python!')
#         continue
#     elif 'фільм' or 'кінотеатр' or 'серіал' in s.lower().replace(' ', ''):
#         print('=>Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал/фільм *ваша відповідь*, '
#               'він просто бомба!')
#         continue
#     elif 'бувай' or 'надобраніч' or 'гудбай' or 'дозустрічі' in s.lower().replace(' ', ''):
#         print('=>Побачимось у мережі, I\'ll be back.')
#         break
#     else:
#         print('invalid input')
